app/controllers/api/auth_controller.rb

  def sign_up
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "winner", "distance", "created_at", "updated_at", "provider", "uid", "encrypted_password", "reset_password_token", "reset_password_sent_at", "allow_password_change", "remember_created_at", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "tokens", "authentication_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"

  def sign_in
    @user = User.find_for_database_authentication(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "user@example.com"], ["LIMIT", 1]]