app/controllers/api/guesses_controller.rb

UPDATE "users" SET "winner" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["winner", true], ["updated_at", "2024-02-21 14:18:00.464455"], ["id", 1]]
INSERT INTO "guesses" ("user_id", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["latitude", -27.4421], ["longitude", -48.5062], ["created_at", "2024-02-21 14:23:04.990158"], ["updated_at", "2024-02-21 14:23:04.990158"]]
---
  def create
    message = ''
    @guess = Guess.new(guess_params)
    @guess.user_id = current_user.id

    distance = GameLogicService.new.calculate_distance(@guess.latitude, @guess.longitude)

    if distance.to_i < 1000
      if !current_user.winner?
        current_user.update(winner: true)
        message = "User #{current_user.email} is new Winner!"
        send_email
      else
        message = "User #{current_user.email} has already Won!"
      end
    end

    if @guess.save