app/controllers/api/winners_controller.rb

  def index
    @winners = User.where(winner: true).order(distance: :asc).page(params[:page]).per(params[:per_page])
---
SELECT "users".* FROM "users" WHERE "users"."winner" = $1 ORDER BY "users"."distance" ASC LIMIT $2 OFFSET $3  [["winner", true], ["LIMIT", 25], ["OFFSET", 0]]